[
  {
    "title":"Software Engineering Co-op",
    "company":"Medtronic",
    "location":"Boston, MA, USA",
    "deadline":"December 19, 2025",
    "compensation":"$20 - $35 per year",
    "targeted major":"College of Engineering\/Robotics\nCollege of Engineering\/Computer System Engineering\nCollege of Engineering\/Computer Engineering\nKhoury College of Computer Sciences\/Computer Science",
    "minimum GPA":"2.75",
    "description":"This software engineering co-op will be focused on integration of next generation tools surrounding Medtronic's new minimally invasive surgical robot, Hugo.  Read this article to learn more about the system: https:\/\/www.massdevice.com\/medtronic-finally-unveils-its-new-robot-assisted-surgery-system\/ This co-op will be embedded in a scrum team with other developers and will be working with C++ and embedded systems daily.\nSpecific Job Functions:\n-Contribute to development and testing of existing applications\n-Develop real-time logging applications for embedded systems\n-Automate existing workflows to enhance the development process\n-Generate ideas for the next project in the surgical robotics space\n  Required Experience:\n-Software integration of different rate data streams\n-Software logging\n-Strong Object Oriented Design programming skills, C++ knowledge strongly preferred\n-Git or comparable version control experience\n  Preferred Experience: \n-Basic knowledge of robotics, kinematics, and controls.\n-Experience with publish\/subscribe messaging such as ROS.\n-Experience with various networking protocols.\n-Experience with database architecture.\n-Previous experience working with Agile software development tools like Bitbucket, Jira (Trello), and Confluence.\n-Python"
  },
  {
    "title":"Software Engineering Co-op",
    "company":"Mobius Industries",
    "location":"Boston, MA, USA",
    "deadline":"December 31, 2025",
    "compensation":"$20 - $30 per hour",
    "targeted major":"College of Engineering\/Electrical and Computer Engineering\nCollege of Engineering\/Computer Engineering\nCollege of Engineering\/Software Engineering Systems\nKhoury College of Computer Sciences\nKhoury College of Computer Sciences\/Computer Science",
    "minimum GPA":"3.0",
    "description":"Experience\nSome experience in either full-stack\/backend, ML\/AI, data science, or embedded\/robotics.\nWillingness to learn, challenge themselves, and grow their own skills.\nResponsibilities\n- Assist in building backend systems, APIs, and core business logic under guidance from senior engineers.\n- Support development of frontend interfaces for customer data analytics and machine HMI tools.\n- Help implement and test user authentication, device security, and cybersecurity features.\n- Contribute to integrating backend, frontend, and hardware signal pathways to ensure reliable platform performance.\n- Participate in troubleshooting and testing during engineering integration and software release cycles.\n- Assist in data collection, cleaning, and preprocessing for machine learning model development.\n- Support experimentation and evaluation of ML models on real-world datasets under supervision.\n- Help profile and optimize ML model inference speed and accuracy.\n- Contribute to documenting ML workflows and integration steps with software and hardware teams.\n- Participate in data analysis to identify trends and support ideation for new products and model improvements."
  },
  {
    "title":"Software Engineering Co-op",
    "company":"Maven AGI",
    "location":"Boston, MA, USA",
    "deadline":"December 22, 2025",
    "compensation":"$28 - $35 per hour",
    "targeted major":"Khoury College of Computer Sciences\/Data Science\nKhoury College of Computer Sciences\/Computer Science",
    "minimum GPA":"2.4",
    "description":"Maven AGI is an enterprise AI platform on a mission to unleash business artificial general intelligence (AGI), starting with customer service. Founded in July 2023 by executives from HubSpot, Google and Stripe, Maven builds conversational AI agents capable of delivering accurate, autonomous support that delights customers at scale.\nOur platform unifies fragmented systems, integrates knowledge and personalization sources, and enables intelligent actions - all without costly system changes. We’re laying the foundation for a future where our technology handles complex tasks, allowing people to focus on what they do best: creative problem-solving, relationship building, and delivering exceptional customer experiences.\nWe’ve started by reimagining the enterprise customer experience with a support use case. We believe that today’s support experience is broken: slow and painful for customers, and expensive and human capital intensive for companies.\nWe are building Maven to deliver better, cheaper support, for both end users and agents. With recent advancements in Generative AI, it is now possible to deliver delightful customer experiences at a fraction of today’s cost.\nJob Description:\nAs a Software Engineering Co-op at Maven AGI, you will primarily work alongside Senior and Staff level engineers, assisting with real feature development to support our customers. You will gain practice experience by working on critical projects for business success. This work will likely involve:\n-Developing and improving AI quality observability systems\n-Enhancing Reliability and scalability of our platform\n-Ensuring data quality and efficient data processing\n-Contributing to API development and integration\nKnowledge, Skills, Abilities:\nWe're looking for candidates with a passion for software development and a drive to learn. Desired skills include:\n-Experience working in Java development, with a solid understanding of Object Oriented Design and Best Practices\n-Familiarity with Spring Boot and microservices architecture\n- Experience with version control systems (Git)\n- Strong analytical and problem-solving skills with a passion for addressing\ncomplex technical challenges.\n- Excellent written and verbal communication skills, facilitating effective\ncollaboration with cross-functional teams.\n- Willingness to learn and adapt to new technologies and programming\nlanguages as necessary.\nQualifications\n- Pursuing a Bachelors in Computer Science, Software Engineering, or a\nrelated field\n- Prior internship or co-op experience preferred\n- Basic understanding of APIs\n- Interest in building large-scale business AI enterprise applications\n- Work Environment: Hybrid with a minimum of 2 days onsite in our Boston\noffice\n- Growing startup with many future growth opportunities\n- Be exposed to a world-class team of Engineers from Google, Meta, Amazon,\nand Stripe, and is supported by executives & Advisors from OpenAI, Google,\nHubSpot, and Stripe."
  },
  {
    "title":"Software Engineering Co-op",
    "company":"getIntro",
    "location":"Boston, MA, USA",
    "deadline":"December 31, 2025",
    "compensation":"$2,000 - $3,000 per month",
    "targeted major":"College of Engineering\nCollege of Engineering\/Information Systems\nCollege of Engineering\/Internet of Things",
    "minimum GPA":"3.0",
    "description":"Company name: getIntro\nJob title: Software Engineering Co-op\nPhysical company location: 55 Court St, 2nd Floor, Boston, MA 02203\nTerm length: Spring 2026 with option to continue through Summer 2026\nStart date: 12\/15\/2025\nEnd date: 8\/31\/2026\nRole type: Hybrid (~50% in person)\nPay rate: $2,000 - $3,000 per month\nAbout getIntro\nAt getIntro, we’re reimagining how enterprise healthcare sales work—from the ground up. Our AI agents don’t just automate tasks; they help sales teams think and act strategically, focusing only on what truly matters: building real human relationships with the right decision-makers. The result? less noise, faster sales cycles, and revenue that lands sooner.\nWe’re a small team of experienced founders who’ve built and exited successful healthtech and AI companies. We’re tackling one of the hardest problems in B2B sales: turning unstructured signals and relationship data into intelligent guidance that actually drives action.\nIf you love moving fast and solving complex technical challenges that have real-world business impact—and want to build alongside people who’ve done it before—this is your chance to get in early and help shape something foundational.\nAbout You\nYou are energized by early-stage startups\nYou are impatient and blazingly fast\nYou love solving hard problems and love to experiment\nYou have interest in agentic AI\nYou think creatively to find simple solutions to hard problems\nYou take ownership and get things done without much handholding\nYou are fearless and jump in to help wherever needed\nAbout the Role\nAble to work a minimum of 20 hours per week\nWorking across the technology stack\nBuilding high-quality semantic search\nBuilding with agentic frameworks\nManaging large data sets and graph data\nDelivering commercial\/production quality code"
  },
  {
    "title":"Software Engineering Co-op (Full-Stack)",
    "company":"ThinkStruct",
    "location":"Boston, MA, USA",
    "deadline":"March 1, 2026",
    "compensation":"$15 - $35 per hour",
    "targeted major":"College of Engineering\/Computer Engineering\nKhoury College of Computer Sciences\/Data Science\nKhoury College of Computer Sciences\/Computer Science",
    "minimum GPA":"2.5",
    "description":"Software Engineering Co-op (Full-Stack) –\n\nLocation: Kendall Sq., Cambridge, MA (In-Person Required)\nStart Date: Spring 2026 \nDuration: Full semester (with potential to extend)\nCompany Overview\nThinkstruct is an MIT delta v and Link Ventures-backed legal tech startup reimagining how patent law is practiced using AI. Our platform accelerates claim mapping, prior art search, and patent prosecution using custom-trained models, intuitive interfaces, and scalable infrastructure. We're a\nsmall, fast-moving team combining technical depth with domain expertise and we’re working at the intersection of software, AI, and legal workflows.\nThe Opportunity\nWe’re looking for a full-time Software Engineering Co-op to join our core team and help build the future of legal infrastructure. You’ll work directly with our CTO (MIT CS + AI) and CEO (MIT Data Science) on building our first live products. This is a\nrare chance to get full exposure to what it takes to build a startup from the ground up.\nYou'll work across the stack and gain experience in product design, user testing, and rapid iteration. You’ll ship code that gets used by real lawyers and researchers.\nWhat You’ll Work On\n● Frontend Development: Build and refine features in our React\/Next.js interface to support document analysis, comparison tools, and visualizations\n● Backend Algorithms: Implement and optimize algorithms for patent claim matching, NLP pipelines, and semantic similarity scoring\n● APIs and Infrastructure: Help scale our Python\/Flask API layer, integrate with vector databases, and automate deployment pipelines\n● Data & Storage: Work with PostgreSQL, Redis, and vector stores to structure and retrieve patent data efficiently\n● User Testing: Collaborate with the product team to rapidly prototype features and gather real user feedback\nPreferred Skills\n● Proficiency in Python and JavaScript\/TypeScript\n● Experience with React, Flask, or Next.js\n● Familiarity with SQL databases, REST APIs, and basic DevOps tools\n● Interest in AI, NLP, or legal\/policy tech (not required, but a plus!)\n● Strong debugging, version control (Git), and testing practices\n● Curiosity, self-direction, and comfort working in ambiguity\nQualifications\n● Current Northeastern undergraduate student in Computer Science, Software Engineering, Data Science, or related fields\n● Prior internship or class project experience in full-stack development\n● Able to commit to a full-time schedule (32–40 hrs\/week) during a semester\n● Based in Boston or able to commute to our Cambridge location in Kendall Square\nWhat You’ll Gain\n● Exposure to cutting-edge AI workflows (LLMs, RAG, semantic search, agentic AI)\n● Experience working directly with a founding team of engineers and domain experts\n● A portfolio of production-grade software you’ve shipped\n● Opportunities to learn more about startups in Boston and pathways to launching your own company\nHow to Apply\nSend your resume, GitHub (or project samples), and a short note on why you're interested to team@thinkstruct.com.\nBonus: tell us about a feature or idea you think could make patent law\nbetter."
  }
]