[
  {
    "title":"Software Engineering Co-op",
    "company":"Medtronic",
    "location":"Boston, MA, USA",
    "deadline":"December 19, 2025",
    "compensation":"$20 - $35 per year",
    "targeted_major":"College of Engineering\/Robotics\nCollege of Engineering\/Computer System Engineering\nCollege of Engineering\/Computer Engineering\nKhoury College of Computer Sciences\/Computer Science",
    "minimum_gpa":"2.75",
    "description":"This software engineering co-op will be focused on integration of next generation tools surrounding Medtronic's new minimally invasive surgical robot, Hugo.  Read this article to learn more about the system: https:\/\/www.massdevice.com\/medtronic-finally-unveils-its-new-robot-assisted-surgery-system\/ This co-op will be embedded in a scrum team with other developers and will be working with C++ and embedded systems daily.\nSpecific Job Functions:\n-Contribute to development and testing of existing applications\n-Develop real-time logging applications for embedded systems\n-Automate existing workflows to enhance the development process\n-Generate ideas for the next project in the surgical robotics space\n  Required Experience:\n-Software integration of different rate data streams\n-Software logging\n-Strong Object Oriented Design programming skills, C++ knowledge strongly preferred\n-Git or comparable version control experience\n  Preferred Experience: \n-Basic knowledge of robotics, kinematics, and controls.\n-Experience with publish\/subscribe messaging such as ROS.\n-Experience with various networking protocols.\n-Experience with database architecture.\n-Previous experience working with Agile software development tools like Bitbucket, Jira (Trello), and Confluence.\n-Python",
    "status":"EXISTING",
    "scraped_at":"2025-12-15T14:26:50.760555",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Software Engineering Co-op",
    "company":"Mobius Industries",
    "location":"Boston, MA, USA",
    "deadline":"December 31, 2025",
    "compensation":"$20 - $30 per hour",
    "targeted_major":"College of Engineering\/Electrical and Computer Engineering\nCollege of Engineering\/Computer Engineering\nCollege of Engineering\/Software Engineering Systems\nKhoury College of Computer Sciences\nKhoury College of Computer Sciences\/Computer Science",
    "minimum_gpa":"3.0",
    "description":"Experience\nSome experience in either full-stack\/backend, ML\/AI, data science, or embedded\/robotics.\nWillingness to learn, challenge themselves, and grow their own skills.\nResponsibilities\n- Assist in building backend systems, APIs, and core business logic under guidance from senior engineers.\n- Support development of frontend interfaces for customer data analytics and machine HMI tools.\n- Help implement and test user authentication, device security, and cybersecurity features.\n- Contribute to integrating backend, frontend, and hardware signal pathways to ensure reliable platform performance.\n- Participate in troubleshooting and testing during engineering integration and software release cycles.\n- Assist in data collection, cleaning, and preprocessing for machine learning model development.\n- Support experimentation and evaluation of ML models on real-world datasets under supervision.\n- Help profile and optimize ML model inference speed and accuracy.\n- Contribute to documenting ML workflows and integration steps with software and hardware teams.\n- Participate in data analysis to identify trends and support ideation for new products and model improvements.",
    "status":"EXISTING",
    "scraped_at":"2025-12-15T14:26:53.471799",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Software Engineering Co-op",
    "company":"Maven AGI",
    "location":"Boston, MA, USA",
    "deadline":"December 22, 2025",
    "compensation":"$28 - $35 per hour",
    "targeted_major":"Khoury College of Computer Sciences\/Data Science\nKhoury College of Computer Sciences\/Computer Science",
    "minimum_gpa":"2.4",
    "description":"Maven AGI is an enterprise AI platform on a mission to unleash business artificial general intelligence (AGI), starting with customer service. Founded in July 2023 by executives from HubSpot, Google and Stripe, Maven builds conversational AI agents capable of delivering accurate, autonomous support that delights customers at scale.\nOur platform unifies fragmented systems, integrates knowledge and personalization sources, and enables intelligent actions - all without costly system changes. We’re laying the foundation for a future where our technology handles complex tasks, allowing people to focus on what they do best: creative problem-solving, relationship building, and delivering exceptional customer experiences.\nWe’ve started by reimagining the enterprise customer experience with a support use case. We believe that today’s support experience is broken: slow and painful for customers, and expensive and human capital intensive for companies.\nWe are building Maven to deliver better, cheaper support, for both end users and agents. With recent advancements in Generative AI, it is now possible to deliver delightful customer experiences at a fraction of today’s cost.\nJob Description:\nAs a Software Engineering Co-op at Maven AGI, you will primarily work alongside Senior and Staff level engineers, assisting with real feature development to support our customers. You will gain practice experience by working on critical projects for business success. This work will likely involve:\n-Developing and improving AI quality observability systems\n-Enhancing Reliability and scalability of our platform\n-Ensuring data quality and efficient data processing\n-Contributing to API development and integration\nKnowledge, Skills, Abilities:\nWe're looking for candidates with a passion for software development and a drive to learn. Desired skills include:\n-Experience working in Java development, with a solid understanding of Object Oriented Design and Best Practices\n-Familiarity with Spring Boot and microservices architecture\n- Experience with version control systems (Git)\n- Strong analytical and problem-solving skills with a passion for addressing\ncomplex technical challenges.\n- Excellent written and verbal communication skills, facilitating effective\ncollaboration with cross-functional teams.\n- Willingness to learn and adapt to new technologies and programming\nlanguages as necessary.\nQualifications\n- Pursuing a Bachelors in Computer Science, Software Engineering, or a\nrelated field\n- Prior internship or co-op experience preferred\n- Basic understanding of APIs\n- Interest in building large-scale business AI enterprise applications\n- Work Environment: Hybrid with a minimum of 2 days onsite in our Boston\noffice\n- Growing startup with many future growth opportunities\n- Be exposed to a world-class team of Engineers from Google, Meta, Amazon,\nand Stripe, and is supported by executives & Advisors from OpenAI, Google,\nHubSpot, and Stripe.",
    "status":"EXISTING",
    "scraped_at":"2025-12-15T14:26:56.158265",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"First-year Engineering Technical Specialist",
    "company":"First Year Engineering Learning & Innovation Center",
    "location":"Boston, MA, USA",
    "deadline":"December 31, 2025",
    "compensation":"$20 per hour",
    "targeted_major":"College of Engineering",
    "minimum_gpa":"2.0",
    "description":"The position is responsible for assisting in the operation of the First-Year Engineering Learning & Innovation Center (FYELIC) by collaborating with Management Staff to ensure the smooth execution of daily operations. This includes overseeing and maintaining machines and equipment, supporting faculty in instructional activities, and assisting students in utilizing the center's resources for coursework and independent projects. Additionally, the role involves developing and delivering OnShape training sessions to enhance students' technical skills, facilitate project development, and provide support for computational problem-solving within engineering applications. The position requires active engagement in fostering an innovative and collaborative learning environment, guiding students in hands-on engineering practices, and\ncontributing to the overall efficiency and functionality of the center.\nQualifications:\nMust be an undergraduate student majoring in Engineering who has not previously completed a co-op.\nExperience with programming languages and design software.\nKnowledge of makerspace tools such as 3D printers, laser cutters, and small hand tools.\nPrevious experience working in a makerspace or engineering lab environment is a plus.\nStrong problem-solving skills, attention to detail, and the ability to work collaboratively in a team setting.\nJob Duties:\nMakerspace Supervision & Student Support\n●Provide general supervision of the FYELIC makerspace and academic support center to\nensure a safe and productive learning environment.\n●Work as a liaison between FYELIC’s Management, student-workers, and students to provide consistent and valuable supervisory coverage and assist in enforcing safety and operational protocols.\n●Facilitate the student project design and development process, offering technical guidance\nand troubleshooting assistance.\nAssist students, student-workers, and faculty with the proper use of equipment, tools, and software to support coursework and research initiatives.\nMaintain an organized and well-stocked workspace by assisting in the procurement and\ninventory management of supplies and materials.\nCreate engaging social media content for outreach to students\nStrive to make FYELIC spaces more accessible, user-friendly, and safe while emphasizing the engineering design process for students and their needs.\nTraining & Documentation Development\nDesign and deliver OnShape training sessions tailored to engineering applications, equipping students with essential computational and coding skills.\nSupport the department’s pedagogical shift by assisting in the development of instructional workshops and training programs.\nAid in the documentation and refinement of best practices for FYELIC operations, ensuring clear and accessible guidelines for users.\nUpdate and maintain standard operating procedures (SOPs) for equipment usage, safety protocols, and troubleshooting processes.\nDevelop supplemental documentation to support student learning in engineering design and prototyping, including materials for Cornerstone courses.\nAssist in the training and onboarding of new student workers, ensuring they are equipped with the necessary knowledge and skills to support FYELIC operations effectively.\nThis role provides a valuable opportunity for students interested in hands-on engineering education, makerspace management, and technical instruction while gaining practical experience in engineering design, fabrication, and programming.\"",
    "status":"EXISTING",
    "scraped_at":"2025-12-15T14:26:58.861841",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Software Engineering Co-op",
    "company":"getIntro",
    "location":"Boston, MA, USA",
    "deadline":"December 31, 2025",
    "compensation":"$2,000 - $3,000 per month",
    "targeted_major":"College of Engineering\nCollege of Engineering\/Information Systems\nCollege of Engineering\/Internet of Things",
    "minimum_gpa":"3.0",
    "description":"Company name: getIntro\nJob title: Software Engineering Co-op\nPhysical company location: 55 Court St, 2nd Floor, Boston, MA 02203\nTerm length: Spring 2026 with option to continue through Summer 2026\nStart date: 12\/15\/2025\nEnd date: 8\/31\/2026\nRole type: Hybrid (~50% in person)\nPay rate: $2,000 - $3,000 per month\nAbout getIntro\nAt getIntro, we’re reimagining how enterprise healthcare sales work—from the ground up. Our AI agents don’t just automate tasks; they help sales teams think and act strategically, focusing only on what truly matters: building real human relationships with the right decision-makers. The result? less noise, faster sales cycles, and revenue that lands sooner.\nWe’re a small team of experienced founders who’ve built and exited successful healthtech and AI companies. We’re tackling one of the hardest problems in B2B sales: turning unstructured signals and relationship data into intelligent guidance that actually drives action.\nIf you love moving fast and solving complex technical challenges that have real-world business impact—and want to build alongside people who’ve done it before—this is your chance to get in early and help shape something foundational.\nAbout You\nYou are energized by early-stage startups\nYou are impatient and blazingly fast\nYou love solving hard problems and love to experiment\nYou have interest in agentic AI\nYou think creatively to find simple solutions to hard problems\nYou take ownership and get things done without much handholding\nYou are fearless and jump in to help wherever needed\nAbout the Role\nAble to work a minimum of 20 hours per week\nWorking across the technology stack\nBuilding high-quality semantic search\nBuilding with agentic frameworks\nManaging large data sets and graph data\nDelivering commercial\/production quality code",
    "status":"EXISTING",
    "scraped_at":"2025-12-15T14:27:01.532447",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Software Engineering Co-op (Full-Stack)",
    "company":"ThinkStruct",
    "location":"Boston, MA, USA",
    "deadline":"March 1, 2026",
    "compensation":"$15 - $35 per hour",
    "targeted_major":"College of Engineering\/Computer Engineering\nKhoury College of Computer Sciences\/Data Science\nKhoury College of Computer Sciences\/Computer Science",
    "minimum_gpa":"2.5",
    "description":"Software Engineering Co-op (Full-Stack) –\n\nLocation: Kendall Sq., Cambridge, MA (In-Person Required)\nStart Date: Spring 2026 \nDuration: Full semester (with potential to extend)\nCompany Overview\nThinkstruct is an MIT delta v and Link Ventures-backed legal tech startup reimagining how patent law is practiced using AI. Our platform accelerates claim mapping, prior art search, and patent prosecution using custom-trained models, intuitive interfaces, and scalable infrastructure. We're a\nsmall, fast-moving team combining technical depth with domain expertise and we’re working at the intersection of software, AI, and legal workflows.\nThe Opportunity\nWe’re looking for a full-time Software Engineering Co-op to join our core team and help build the future of legal infrastructure. You’ll work directly with our CTO (MIT CS + AI) and CEO (MIT Data Science) on building our first live products. This is a\nrare chance to get full exposure to what it takes to build a startup from the ground up.\nYou'll work across the stack and gain experience in product design, user testing, and rapid iteration. You’ll ship code that gets used by real lawyers and researchers.\nWhat You’ll Work On\n● Frontend Development: Build and refine features in our React\/Next.js interface to support document analysis, comparison tools, and visualizations\n● Backend Algorithms: Implement and optimize algorithms for patent claim matching, NLP pipelines, and semantic similarity scoring\n● APIs and Infrastructure: Help scale our Python\/Flask API layer, integrate with vector databases, and automate deployment pipelines\n● Data & Storage: Work with PostgreSQL, Redis, and vector stores to structure and retrieve patent data efficiently\n● User Testing: Collaborate with the product team to rapidly prototype features and gather real user feedback\nPreferred Skills\n● Proficiency in Python and JavaScript\/TypeScript\n● Experience with React, Flask, or Next.js\n● Familiarity with SQL databases, REST APIs, and basic DevOps tools\n● Interest in AI, NLP, or legal\/policy tech (not required, but a plus!)\n● Strong debugging, version control (Git), and testing practices\n● Curiosity, self-direction, and comfort working in ambiguity\nQualifications\n● Current Northeastern undergraduate student in Computer Science, Software Engineering, Data Science, or related fields\n● Prior internship or class project experience in full-stack development\n● Able to commit to a full-time schedule (32–40 hrs\/week) during a semester\n● Based in Boston or able to commute to our Cambridge location in Kendall Square\nWhat You’ll Gain\n● Exposure to cutting-edge AI workflows (LLMs, RAG, semantic search, agentic AI)\n● Experience working directly with a founding team of engineers and domain experts\n● A portfolio of production-grade software you’ve shipped\n● Opportunities to learn more about startups in Boston and pathways to launching your own company\nHow to Apply\nSend your resume, GitHub (or project samples), and a short note on why you're interested to team@thinkstruct.com.\nBonus: tell us about a feature or idea you think could make patent law\nbetter.",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:04.226959",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Electrical Co-op",
    "company":"BuroHappold Engineering",
    "location":"Boston, MA, USA",
    "deadline":"January 31, 2026",
    "compensation":"$22 - $32 per hour",
    "targeted_major":"College of Engineering\nCollege of Engineering\/Telecommunications-System Management\nCollege of Engineering\/Telecommunication Networks\nCollege of Engineering\/Electrical Engineering\nCollege of Engineering\/Electrical and Computer Engineering",
    "minimum_gpa":"3.0",
    "description":"Start designing tomorrow’s future!\nBuro Happold has an exciting opportunity for a collaborative and enthusiastic Electrical Co-op to join our welcoming and diverse workplace culture in Boston! \nAs an Electrical Co-op, you will work with some of the brightest minds in the industry, contributing to unique and innovative projects that inspire awe, transform communities, and help to combat climate change.  \nHere at Buro Happold, expect the exceptional.\nFrom the projects you will work on to the clients we work with. From career-defining opportunities to an inclusive and diverse practice where we all contribute to a more equitable world. From our reputation to our relationships. Wherever your Buro Happold career takes you, it’ll be anything but ordinary.\nYour next role\nJoin us and be surrounded by exceptional opportunities in an environment alive with innovation and possibility. Your new team has a willingness and curiosity to see possibility and potential in everything – from the most iconic projects to our everyday conversations. \nLearn more about Electrical Engineering at Buro Happold\nYour key duties: As an Electrical Co-op, you will collaborate with other engineers to develop creative, energy-efficient buildings that provide aesthetics to their physical surroundings and utility to their occupants. In return, we’ll help you meet your goals, respect your ideas, and foster your creativity, collaboration, and innovation. \nUndertake electrical engineering building services design and calculations (using software and knowledge to verify robust calculations such as Design Master and SKM)\nEmbrace the latest technologies to improve performance and sustainability\nUsing Revit, prepare technical drawings, schedules, and reports\nAnalyze load to determine system sizing, and assign circuitry for power and lighting devices\nYour skills and experience\nThis role will require the following:\nCurrently pursuing a Bachelor's or Master's degree in Electrical Engineering or Architectural Engineering\nCoursework in electrical power systems design, control systems, and\/or building systems design\nInterest in the electrical engineering industry with an emphasis on the power side of the discipline\nAcademic research, coursework, or other experience with alternative energy systems and other technologies new to the construction industry preferred\nFamiliarity with BIM modelling software, such as Revit, AutoCAD\nInternship experience at engineering related firm preferred, and proven interest in the built environment\nAbility to communicate thoughts and technical ideas in an accessible manner\nEagerness to learn and work as part of a multidisciplinary team\nWhat we offer:\n\nCurrently pursuing a Bachelor's degree in Mechanical, Civil, Sanitary, Environmental, or Architectural Engineering\nCoursework in mechanical\/HVAC design, heat transfer, fluid dynamics, and\/or thermodynamics\nFamiliarity with BIM modelling software, such as Revit and AutoCAD\nInternship experience at engineering related firm preferred, and proven interest in the built environment\nAbility to communicate thoughts and technical ideas in an accessible manner\nEagerness to learn and work as part of a multidisciplinary team\nLearn more about our office locations\nReady for something a little less ordinary? \nApply now to start your career journey with us. ",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:06.933076",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Graduate Mechanical Engineer",
    "company":"BuroHappold Engineering",
    "location":"Boston, MA, USA\nNew York, NY, USA\nChicago, IL, USA\nAtlanta, GA, USA",
    "deadline":"January 31, 2026",
    "compensation":"$77,000 - $80,000 per year",
    "targeted_major":"College of Arts, Media & Design\/Architecture\nCollege of Engineering\nCollege of Engineering\/Environmental Engineering\nCollege of Engineering\/Civil Engineering",
    "minimum_gpa":"Not listed",
    "description":"Start designing tomorrow’s future!\nBuro Happold has an exciting opportunity for a collaborative and enthusiastic Graduate Mechanical Engineer to join our welcoming and diverse workplace culture! \nHere at Buro Happold, expect the exceptional.\nFrom the projects you will work on to the clients we work with. From career-defining opportunities to an inclusive and diverse practice where we all contribute to a more equitable world. From our reputation to our relationships. Wherever your Buro Happold career takes you, it’ll be anything but ordinary.\nYour next role\nJoin us and be surrounded by exceptional opportunities in an environment alive with innovation and possibility. Your new team has a willingness and curiosity to see possibility and potential in everything – from the most iconic projects to our everyday conversations. \nLearn more about Mechanical Engineering at Buro Happold\nYour key duties:\nEmbrace the latest technologies to improve performance and sustainability \nPerform detailed HVAC engineering building services design and calculations using software and knowledge to verify robust calculations \nPrepare technical drawings, schedules, and reports \nEnsure service and project work are carried out to an excellent standard within agreed deadlines and budget \nYour skills and experience\nThis role will require the following:\nBachelor's in Mechanical, Civil, Sanitary, Environmental, or Architectural Engineering. \nMaster's degree preferred\nCoursework in HVAC design, heat transfer, thermodynamics, and fluid hydraulics\/dynamics. \nFamiliarity with BIM modelling software, such as Revit and AutoCAD\nKnowledge of HVAC load modelling software a plus\nInternship experience at engineering related firm preferred, and proven interest in the built environment\nAbility to communicate thoughts and technical ideas in an accessible manner\nEagerness to learn and work as part of a multidisciplinary team\nWhat we offer:\nSalary range of $77,000 to $80,000. This will be determined based on factors such as geographic location, skills, education, and\/or experience\nGenerous benefits package\nAnnual discretionary bonus\nGenerous PTO (4 weeks) in addition to 10 paid holidays\n401k with company match\nHybrid working & summer hours\nReimbursement for certain professional licenses and associated renewals and exam fees\nConnection to global network of experts on the forefront of industry initiatives\nAccess to wide ranging learning and development opportunities\nBe a part of supporting our diverse company culture through open engagement with our Young Employees Forum, Diversity and Inclusion Forum, Buro Happold Women's Network, and\/or our Black at Buro Happold Employee Resource Groups\nLearn more about our office locations\n\nReady for something a little less ordinary? \nApply now to start your career journey with us. ",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:09.605112",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Graduate Plumbing & Fire Protection Engineer",
    "company":"BuroHappold Engineering",
    "location":"Washington, DC, USA\nNew York, NY, USA\nBoston, MA, USA\nChicago, IL, USA",
    "deadline":"January 31, 2026",
    "compensation":"$77,000 - $80,000 per year",
    "targeted_major":"College of Engineering",
    "minimum_gpa":"Not listed",
    "description":"Start designing tomorrow’s future!\nBuro Happold is looking for a dedicated and collaborative Graduate Plumbing & Fire Protection Engineer to join our inclusive and welcoming team!\nHere at Buro Happold, expect the exceptional.\nFrom the projects you will work on to the clients we work with. From career-defining opportunities to an inclusive and diverse practice where we all contribute to a more equitable world. From our reputation to our relationships. Wherever your Buro Happold career takes you, it’ll be anything but ordinary.\nYour next role\nJoin us and be surrounded by exceptional opportunities in an environment alive with innovation and possibility. Your new team has a willingness and curiosity to see possibility and potential in everything – from the most iconic projects to our everyday conversations. \nLearn more about Fire and Plumbing Protection Engineering at Buro Happold\nYour key duties: As a Graduate Plumbing and Fire Protection Engineer you will assist in the design, documentation, and coordination of plumbing and fire protection systems for various building types. The role is ideal for recent graduates looking to gain hands-on experience in building systems engineering.\nSupport the development of plumbing and fire protection system designs under the guidance of senior engineers.\nPrepare construction drawings from schematic design through construction administration.\nPerform calculations using standard engineering software and tools.\nConduct field surveys to document existing conditions and observe progress during construction.\nParticipate in interdisciplinary coordination with architectural, structural, electrical, mechanical and civil engineering teams.\nAssist in client meetings and value engineering sessions.\nContribute to quality assurance and constructability reviews.\nHelp develop discipline specific standards and specifications.\nEnsure service and project work are carried out to an excellent standard and quality within agreed deadlines and budget.\nYour skills and experience\nThis role will require the following:\nBachelor's or Master's degree in Mechanical, Fire Protection, Civil, Sanitary, Environmental, or Architectural Engineering.\nCoursework in mechanical design, heat transfer, thermodynamics, and fluid hydraulics\/dynamics.\nAwareness of building, plumbing and fire codes, (IPC, NFPA).\nProficiency with BIM modelling software, such as Revit and AutoCAD.\nInternship experience at engineering related firm preferred, and proven interest in the built environment and sustainable design.\nAbility to communicate thoughts and technical ideas in an accessible manner.\nEagerness to learn and work as part of a multidisciplinary team.\nWhat we offer:\nSalary range of $73,000 to $80,000.This will be determined based on factors such as geographic location, skills, education, and\/or experience\nGenerous benefits package\nAnnual discretionary bonus\nGenerous PTO (4 weeks) in addition to 10 paid holidays\n401k with company match\nHybrid working & summer hours\nReimbursement for certain professional licenses and associated renewals and exam fees\nConnection to global network of experts on the forefront of industry initiatives\nAccess to wide ranging learning and development opportunities\nBe a part of supporting our diverse company culture through open engagement with our Young Employees Forum, Diversity and Inclusion Forum, Buro Happold Women's Network, and\/or our Black at Buro Happold Employee Resource Groups\nLearn more about our office locations\nReady for something a little less ordinary? \nApply now to start your career journey with us. ",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:12.264033",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Electrical Intern",
    "company":"BuroHappold Engineering",
    "location":"Los Angeles, CA, USA\nBoston, MA, USA\nNew York, NY, USA",
    "deadline":"January 31, 2026",
    "compensation":"$22 - $32 per hour",
    "targeted_major":"College of Engineering\nCollege of Engineering\/Telecommunications-System Management\nCollege of Engineering\/Telecommunication Networks\nCollege of Engineering\/Electrical Engineering\nCollege of Engineering\/Electrical and Computer Engineering",
    "minimum_gpa":"Not listed",
    "description":"Start designing tomorrow’s future!\nBuro Happold has an exciting opportunity for a collaborative and enthusiastic Electrical Intern to join our welcoming and diverse workplace culture! \nAs an Electrical Intern, you will work with some of the brightest minds in the industry, contributing to unique and innovative projects that inspire awe, transform communities, and help to combat climate change.  \nHere at Buro Happold, expect the exceptional.\nFrom the projects you will work on to the clients we work with. From career-defining opportunities to an inclusive and diverse practice where we all contribute to a more equitable world. From our reputation to our relationships. Wherever your Buro Happold career takes you, it’ll be anything but ordinary.\nYour next role\nJoin us and be surrounded by exceptional opportunities in an environment alive with innovation and possibility. Your new team has a willingness and curiosity to see possibility and potential in everything – from the most iconic projects to our everyday conversations. \nLearn more about Electrical Engineering at Buro Happold\nYour key duties: As an Electrical Intern, you will collaborate with other engineers to develop creative, energy-efficient buildings that provide aesthetics to their physical surroundings and utility to their occupants. In return, we’ll help you meet your goals, respect your ideas, and foster your creativity, collaboration, and innovation. \nUndertake electrical engineering building services design and calculations (using software and knowledge to verify robust calculations such as Design Master and SKM)\nEmbrace the latest technologies to improve performance and sustainability\nUsing Revit, prepare technical drawings, schedules, and reports\nAnalyze load to determine system sizing, and assign circuitry for power and lighting devices\nYour skills and experience\nThis role will require the following:\nCurrently pursuing a Bachelor's or Master's degree in Electrical Engineering or Architectural Engineering\nCoursework in electrical power systems design, control systems, and\/or building systems design\nInterest in the electrical engineering industry with an emphasis on the power side of the discipline\nAcademic research, coursework, or other experience with alternative energy systems and other technologies new to the construction industry preferred\nFamiliarity with BIM modelling software, such as Revit, AutoCAD\nInternship experience at engineering related firm preferred, and proven interest in the built environment\nAbility to communicate thoughts and technical ideas in an accessible manner\nEagerness to learn and work as part of a multidisciplinary team\nWhat we offer:\n\nHourly rate of $22 to $32 per hour depending on level of education and geographic location\nHybrid working & summer hours\nConnection to global network of experts on the forefront of industry initiatives\nAccess to wide ranging learning and development opportunities\nBe a part of supporting our diverse company culture through open engagement with our Young Employees Forum, Diversity and Inclusion Forum, Buro Happold Women's Network, and\/or our Black at Buro Happold Employee Resource Groups\nLearn more about our office locations\nReady for something a little less ordinary? \nApply now to start your career journey with us. ",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:14.943139",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Graduate Electrical Engineer",
    "company":"BuroHappold Engineering",
    "location":"Washington, DC, USA\nChicago, IL, USA\nLos Angeles, CA, USA\nBoston, MA, USA",
    "deadline":"January 31, 2026",
    "compensation":"$77,000 - $80,000 per year",
    "targeted_major":"College of Engineering\nCollege of Engineering\/Telecommunications-System Management\nCollege of Engineering\/Telecommunication Networks\nCollege of Engineering\/Electrical Engineering\nCollege of Engineering\/Electrical and Computer Engineering",
    "minimum_gpa":"Not listed",
    "description":"Start designing tomorrow’s future!\nBuro Happold has an exciting opportunity for a collaborative and enthusiastic Graduate Electrical Engineer to join our welcoming and diverse workplace culture! \nHere at Buro Happold, expect the exceptional.\nFrom the projects you will work on to the clients we work with. From career-defining opportunities to an inclusive and diverse practice where we all contribute to a more equitable world. From our reputation to our relationships. Wherever your Buro Happold career takes you, it’ll be anything but ordinary.\nYour next role\nJoin us and be surrounded by exceptional opportunities in an environment alive with innovation and possibility. Your new team has a willingness and curiosity to see possibility and potential in everything – from the most iconic projects to our everyday conversations. \nLearn more about Electrical Engineering at Buro Happold\nYour key duties: As an Electrical Intern, you will collaborate with other engineers to develop creative, energy-efficient buildings that provide aesthetics to their physical surroundings and utility to their occupants. In return, we’ll help you meet your goals, respect your ideas, and foster your creativity, collaboration, and innovation. \nUndertake electrical engineering building services design and calculations (using software and knowledge to verify robust calculations such as Design Master and SKM)\nEmbrace the latest technologies to improve performance and sustainability\nUsing Revit, prepare technical drawings, schedules, and reports\nAnalyze load to determine system sizing, and assign circuitry for power and lighting devices\nYour skills and experience\nThis role will require the following:\nBachelor's or Master's degree in Electrical Engineering or Architectural Engineering\nCoursework in electrical power systems design, control systems, and\/or building systems design\nInterest in the electrical engineering industry with an emphasis on the power side of the discipline\nAcademic research, coursework, or other experience with alternative energy systems and other technologies new to the construction industry preferred\nFamiliarity with BIM modelling software, such as Revit, AutoCAD\nInternship experience at engineering related firm preferred, and proven interest in the built environment\nAbility to communicate thoughts and technical ideas in an accessible manner\nEagerness to learn and work as part of a multidisciplinary team\nWhat we offer:\n\nSalary range of $73,000 to $80,000. This will be determined based on factors such as geographic location, skills, education, and\/or experience\nGenerous benefits package\nAnnual discretionary bonus\nGenerous PTO (4 weeks) in addition to 10 paid holidays\n401k with company match\nHybrid working & summer hours\nReimbursement for certain professional licenses and associated renewals and exam fees\nConnection to global network of experts on the forefront of industry initiatives\nAccess to wide ranging learning and development opportunities\nBe a part of supporting our diverse company culture through open engagement with our Young Employees Forum, Diversity and Inclusion Forum, Buro Happold Women's Network, and\/or our Black at Buro Happold Employee Resource Groups\nLearn more about our office locations\nReady for something a little less ordinary? \nApply now to start your career journey with us. ",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:17.641641",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Mechanical Intern",
    "company":"BuroHappold Engineering",
    "location":"New York, NY, USA\nLos Angeles, CA, USA\nBoston, MA, USA",
    "deadline":"January 1, 2026",
    "compensation":"$22 - $32 per hour",
    "targeted_major":"College of Engineering\nCollege of Engineering\/Mechanical Engineering\nCollege of Engineering\/Environmental Engineering\nCollege of Engineering\/Civil Engineering",
    "minimum_gpa":"Not listed",
    "description":"Start designing tomorrow’s future!\nBuro Happold has an exciting opportunity for a collaborative and enthusiastic Mechanical Intern to join our welcoming and diverse workplace culture!\nAs a Mechanical Intern, you will work with some of the brightest minds in the industry, contributing to unique and innovative projects that inspire awe, transform communities, and help to combat climate change.  \nHere at Buro Happold, expect the exceptional.\nFrom the projects you will work on to the clients we work with. From career-defining opportunities to an inclusive and diverse practice where we all contribute to a more equitable world. From our reputation to our relationships. Wherever your Buro Happold career takes you, it’ll be anything but ordinary.\nYour next role\nJoin us and be surrounded by exceptional opportunities in an environment alive with innovation and possibility. Your new team has a willingness and curiosity to see possibility and potential in everything – from the most iconic projects to our everyday conversations. \nLearn more about Mechanical Engineering at Buro Happold\nYour key duties: As a Mechanical Intern, you will learn about HVAC systems and collaborate with architects and other engineers to develop creative, energy-efficient buildings that provide aesthetics to their physical surroundings and utility to their occupants. In return, we’ll help you meet your goals, respect your ideas, and foster your creativity, collaboration, and innovation.  \nEmbrace the latest technologies to improve performance and sustainability\nPerform detailed HVAC engineering building services design and calculations, using software and knowledge to verify robust calculations\nEnsure service and project work are carried out to an excellent standard\nPrepare technical drawings, schedules, and reports \nYour skills and experience\nThis role will require the following:\nCurrently pursuing a Bachelor's degree in Mechanical, Civil, Sanitary, Environmental, or Architectural Engineering\nCoursework in mechanical\/HVAC design, heat transfer, fluid dynamics, and\/or thermodynamics\nFamiliarity with BIM modelling software, such as Revit and AutoCAD\nInternship experience at engineering related firm preferred, and proven interest in the built environment\nAbility to communicate thoughts and technical ideas in an accessible manner\nEagerness to learn and work as part of a multidisciplinary team\nWhat we offer:\n\nHourly rate of $22 to $32 per hour depending on level of education and geographic location\nHybrid working & summer hours\nConnection to global network of experts on the forefront of industry initiatives\nAccess to wide ranging learning and development opportunities\nBe a part of supporting our diverse company culture through open engagement with our Young Employees Forum, Diversity and Inclusion Forum, Buro Happold Women's Network, and\/or our Black at Buro Happold Employee Resource Groups\nLearn more about our office locations\nReady for something a little less ordinary? \nApply now to start your career journey with us. ",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:20.294405",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Plumbing & Fire Protection Intern",
    "company":"BuroHappold Engineering",
    "location":"New York, NY, USA\nBoston, MA, USA\nLos Angeles, CA, USA",
    "deadline":"January 31, 2026",
    "compensation":"$22 - $32 per hour",
    "targeted_major":"College of Engineering",
    "minimum_gpa":"Not listed",
    "description":"Start designing tomorrow’s future!\nBuro Happold is looking for a dedicated and collaborative Plumbing and Fire Protection Intern to join our inclusive and welcoming team!\nHere at Buro Happold, expect the exceptional.\nFrom the projects you will work on to the clients we work with. From career-defining opportunities to an inclusive and diverse practice where we all contribute to a more equitable world. From our reputation to our relationships. Wherever your Buro Happold career takes you, it’ll be anything but ordinary.\nYour next role\nJoin us and be surrounded by exceptional opportunities in an environment alive with innovation and possibility. Your new team has a willingness and curiosity to see possibility and potential in everything – from the most iconic projects to our everyday conversations. \nLearn more about Fire and Plumbing Protection Engineering at Buro Happold\nYour key duties: As a Plumbing\/Fire Protection Intern, you will support the engineering team in designing, modeling and collaborating with other team members for various building projects. This internship offers hands-on experience in system design, BIM modeling, site visits and exposure to industry standards and codes. In return, we’ll help you meet your goals, respect your ideas, and foster your creativity, collaboration, and innovation.\nAssist in the design of plumbing and fire protection systems under the supervision of a senior engineer.\nContribute to Revit\/BIM modeling of construction drawings from schematic design through construction administration.\nCollaborate with multidisciplinary teams on project coordination.\nParticipate in site visits to verify existing conditions and observe progress during construction.\nEnsure service and project work are carried out to an excellent standard and quality.\nYour skills and experience\nThis role will require the following:\nCoursework in Mechanical, Civil, Fire Protection or Architectural Engineering.\nFamiliarity with BIM modelling software, such as Revit and AutoCAD.\nInternship experience at engineering related firm beneficial, and proven interest in the built environment and sustainable design practices.\nAbility to communicate thoughts and technical ideas in an accessible manner.\nEagerness to learn and work as part of a multidisciplinary team.\nWhat we offer:\nHourly rate of $22 to $32 per hour depending on level of education and geographic location\nHybrid working & summer hours\nConnection to global network of experts on the forefront of industry initiatives\nAccess to wide ranging learning and development opportunities\nBe a part of supporting our diverse company culture through open engagement with our Young Employees Forum, Diversity and Inclusion Forum, Buro Happold Women's Network, and\/or our Black at Buro Happold Employee Resource Groups\nLearn more about our office locations\nReady for something a little less ordinary? \nApply now to start your career journey with us. ",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:22.948266",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Software Engineering Co-op - January 2026",
    "company":"Wayfair LLC",
    "location":"Boston, MA, USA",
    "deadline":"December 15, 2025",
    "compensation":"$35 per hour",
    "targeted_major":"College of Engineering\/Computer Engineering\nCollege of Science\/Applied Physics\nCollege of Science\/Applied Mathematics\nCollege of Social Sciences & Humanities\/Economics\nD'Amore-McKim School of Business\/Supply Chain Management\nKhoury College of Computer Sciences",
    "minimum_gpa":"3.0",
    "description":"You must apply on NUworks and using the link given after submitting your application\nProgram Dates: January 5, 2026 - June 19, 2026\n The base pay for this position is $35\/hour\n This is a Boston based opportunity with a 3 day in office expectation (Tuesday - Thursday) with 2 days remote (Monday and Friday)\n  Who We Are: \nOur Engineering team within our Technology organization is building the future of home and looking for dynamic, hardworking and talented students to join us for a 6-month Co-op from January 5, 2026 - June 19, 2026. As a Software Engineering Co-op you will dive into a number of complex technical projects and gain a better understanding of our business. The Co-op program is designed to give you real work on your team, so you’ll be contributing to the goals of your team and making an impact.\n  What You’ll Do: \nWork on individual and group projects focused on the full project life-cycle\nCollaborate with business leaders and key stakeholders to brainstorm on how to solve challenges\nGet  to a broad spectrum of technologies and programming languages\nImprove your designs and jumpstart your learning  \nGain  access to technology\/engineering leadership who want to hear your ideas\nParticipate in events with Co-ops across the business!\nReceive professional development training to improve your soft and hard skills \n  What You’ll Need: \nBasic Qualifications:\nCurrently pursuing a Bachelor's degree in computer science or other related technical field, with the expectation that degree will be obtained between 2027 and 2028\nMinimum GPA of 3.0\nAble to commit to working 40 hours\/week (9am-5pm, Monday-Friday) from January 5, 2026 to June 19, 2026\nMust be returning to the course of study following completion of the Co-op\nPreferred Qualifications:\nProven track record of strong academic performance\nExperience with full stack and\/or mobile development\nKnowledge and experience working with object oriented programming languages\nExperience or exposure to SQL, JavaScript and HTML, Python, HTML\/CSS (this is not required for all teams) \nInterest in working with big data and machine learning\nYou enjoy autonomy and the opportunity to make a project or tool on your own\nStrong communication skills\nStrong comfort level and appetite to use AI in daily workflow\n  Potential Team Placements Include: \nSupply Chain Retail Tech: This team develops the complex, ground-breaking logistics system to help move the products Wayfair sells from suppliers to warehouses to customers. Supply Chain is responsible for international transportation, warehouse management, and the customer delivery network making it all possible.\n  Customer Technology: The Customer Technology organization at Wayfair is dedicated to building and optimizing the digital experiences that empower our customers throughout their journey, from initial inspiration to successful purchase. This team is structured into four key areas: 1) Growth, driving traffic and engagement through marketing tech and landing experiences, 2) Discovery, personalizing the user experience with our search engine and personalization features, 3) Purchase, optimizing conversion via cart, checkout, payments, and services, and 4) Platforms, building the foundational web and app infrastructure for our customer journeys.\n  Why You’ll Love Wayfair:\nThroughout the Co-op Program, we provide Co-ops with the opportunity to engage in social and community building activities including:\nA calendar of events including social networking, professional development, and dialogue events with senior leaders\nFormalized mentorship program along with an assigned reporting manager for impactful professional development and feedback\nSkills-based training\nCoffee chat opportunities for Co-ops to get to know one another \n  Purpose & Inclusion at Wayfair:\nAt Wayfair, we pride ourselves on fostering an environment where every individual experiences a fair and equitable employee journey. We are committed to developing targeted resources that raise awareness around inclusion and eliminate barriers, ensuring Wayfair provides a fair and inclusive workplace experience for everyone.\n\nSocial Impact & Responsibility:\nAt Wayfair, we focus on helping people on their journey to home - specifically those who have lost their way from home. We do this by leveraging our best assets, such as collaborating with leading nonprofit organizations, coordinating in-kind product donations, empowering our employees to get involved through paid volunteer time off programs, and encouraging our customers to donate. This multi-faceted approach allows us to support communities in need in authentic ways that align with Wayfair's broader mission of helping everyone, anywhere create their sense of home.\nAssistance for Individuals with Disabilities\nWayfair is fully committed to providing equal opportunities for all individuals, including individuals with disabilities. As part of this commitment, Wayfair will make reasonable accommodations to the known physical or mental limitations of qualified individuals with disabilities, unless doing so would impose an undue hardship on business operations. If you require a reasonable accommodation to participate in the job application or interview process, please contact candidateaccommodations@wayfair.com.\n \nNeed Technical Assistance?\nIf you are having any technical difficulty submitting your application, please reach out to our careers team at careers@wayfair.com.\n \nAbout Wayfair Inc.\nYour personal data is processed in accordance with our Candidate Privacy Notice (https:\/\/www.wayfair.com\/careers\/privacy). If you have any questions or wish to exercise your rights under applicable privacy and data protection laws, please contact us at dataprotectionofficer@wayfair.com.",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:26.105287",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Graduate ICT Engineer",
    "company":"BuroHappold Engineering",
    "location":"Los Angeles, CA, USA\nBoston, MA, USA",
    "deadline":"January 31, 2026",
    "compensation":"$77,000 - $80,000 per year",
    "targeted_major":"College of Arts, Media & Design\/Architecture\nCollege of Engineering\/Electrical Engineering\nCollege of Engineering\/Civil Engineering",
    "minimum_gpa":"Not listed",
    "description":"Start designing tomorrow’s future!\nBuro Happold has an exciting opportunity for a collaborative and enthusiastic Graduate ICT Engineer to join our welcoming and diverse workplace culture!\nHere at Buro Happold, expect the exceptional.\nFrom the projects you will work on to the clients we work with. From career-defining opportunities to an inclusive and diverse practice where we all contribute to a more equitable world. From our reputation to our relationships. Wherever your Buro Happold career takes you, it’ll be anything but ordinary.\nYour next role\nJoin us and be surrounded by exceptional opportunities in an environment alive with innovation and possibility. Your new team has a willingness and curiosity to see possibility and potential in everything – from the most iconic projects to our everyday conversations. \nLearn more about ICT at Buro Happold\nYour key duties: As a Graduate ICT Engineer, you will collaborate with architects and engineers to develop creative, energy-efficient buildings that provide aesthetics to their physical surroundings and utility to their occupants.  \nUndertake detailed ICT engineering building services design and calculations (using software and knowledge to verify robust calculations)\nEmbrace the latest technologies and trends to improve performance and sustainability\nPrepare technical book specifications and schedules, design development reports and innovative design solutions\nAnalyze telecommunications systems and assign circuitry for telecommunications devices.\nParticipate in Information and Communications Technology Team weekly meetings and perform ICT administrative tasks.\nSupport other engineers with CCTV, Access Control, Intrusion Detection and Audio- Visual system designs and drawings. \nCollaborate with other team members regarding telecommunications system designs and interoperability.  \nYour skills and experience\nThis role will require the following:\nBachelor or Master’s Degree in Electrical or Architectural Engineering\nExperience with Microsoft Office, Revit MEP, AutoCAD, or Project (preferred)\nFamiliarity with technical presentations and writing\nInterest or experience in visual programming (Dynamo, Grasshopper), coding (Python, C#), or open source coding projects\nThe ability to multi-task, effectively manage time, and maintain ongoing project focus\nInternship experience at an engineering-related firm (preferred) and proven interest in the built environment\nWhat we offer:\nSalary range of $73,000 to $80,000. This will be determined based on factors such as geographic location, skills, education, and\/or experience\nGenerous benefits package\nAnnual discretionary bonus\nGenerous PTO (4 weeks) in addition to 10 paid holidays\n401k with company match\nHybrid working & summer hours\nReimbursement for certain professional licenses and associated renewals and exam fees\nConnection to global network of experts on the forefront of industry initiatives\nAccess to wide ranging learning and development opportunities\nBe a part of supporting our diverse company culture through open engagement with our Young Employees Forum, Diversity and Inclusion Forum, Buro Happold Women's Network, and\/or our Black at Buro Happold Employee Resource Groups\nLearn more about our office locations\nReady for something a little less ordinary? \nApply now to start your career journey with us. ",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:28.768977",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Advisory Building Performance Intern",
    "company":"BuroHappold Engineering",
    "location":"Boston, MA, USA\nNew York, NY, USA\nWashington, DC, USA",
    "deadline":"January 31, 2026",
    "compensation":"$22 - $32 per hour",
    "targeted_major":"College of Engineering\/Environmental Engineering\nCollege of Engineering\/Electrical Engineering\nCollege of Engineering\/Civil Engineering\nCollege of Engineering\/Engineering and Public Policy\nCollege of Science\/Environmental Studies\nCollege of Science\/Environmental & Sustainability Sciences\nCollege of Social Sciences & Humanities\/Public Policy & Administration",
    "minimum_gpa":"Not listed",
    "description":"Start designing tomorrow’s future!\nIf you have an interest in the built environment and building performance in addition to policy and planning, ESG and sustainability, economics and revitalization, infrastructure and resilience, and\/or climate action and decarbonization strategies and want to work with some of the world’s most innovative clients, Buro Happold has the perfect role for you. We are seeking a passionate intern to join our Advisory Building Performance Team on a full-time basis during summer 2026. This role can be based in Boston, New York, or Washington, D.C.! \nHere at Buro Happold, expect the exceptional.\nFrom the projects you will work on to the clients we work with. From career-defining opportunities to an inclusive and diverse practice where we all contribute to a more equitable world. From our reputation to our relationships. Wherever your Buro Happold career takes you, it’ll be anything but ordinary.\nYour next role\nAs an intern on our Advisory Building Performance Team, you will work on energy and whole-life carbon analysis for multi-scaled projects including high-performance buildings, campus, and cities, including projects featuring net-zero energy and carbon, Living Building Challenge certified projects, LEED certified projects, and calibrated modeling for performance based decarbonization upgrades.  You will work closely with our MEP engineers and sustainability and energy advisory experts and will be technically and creatively challenged on projects that include design support and innovation, strategy and policy development, high-performance strategies, materials research, energy, carbon, water and waste analysis and modelling, etc. From helping shape cities, to adapting infrastructure to deal with climate emergencies, a career at Buro Happold presents the chance to make a difference. \nLearn more about Advisory at Buro Happold\nYour key duties:\nAssist with whole building energy modeling and whole-life carbon analysis for building performance evaluation with industry standard software \nEvaluate resource consumption for sites and buildings across energy, water, and waste as well as evaluating GHG emissions and study opportunities to reduce impact and consumption  \nResearch sustainability and urban design strategies, best practices and benchmarks, policy advancements, and other topics   \nSupport building projects pursuing certification using a wide variety of building certification systems such as LEED, WELL, Fitwel, ILFI Zero Carbon, LBC, etc. or clients developing ESG strategies  \nHelp investigate preferred site strategies for stormwater management, external comfort, heat island reduction, improved air and acoustic quality, biodiversity and ecology, enhanced user experience \nAssess renewable energy production feasibility and research viable technologies and available funding and incentive opportunities.  \nCreate client PowerPoint presentations, memos, reports, graphics, and presentations\nYour skills and experience\nThe successful candidate will be currently pursuing a bachelor or master’s degree in architectural Engineering, energy engineering, mechanical or civil engineering, urban planning & development, environmental engineering, Economics and Real Estate, Public Policy, environmental science or similar. We also expect you to have the following:\nA passion for sustainability \nExperience using Revit, GIS, AutoCAD, or other design tools  \nGraphic skills and experience using Adobe Creative Suite is preferred \nProven interest in the built environment \nAbility to communicate thoughts and technical ideas in an accessible manner \nEagerness to learn and work as part of a multidisciplinary team \nWhat we offer:\nHourly rate of $22 to $32 per hour depending on level of education and geographic location\nHybrid working & summer hours\nConnection to global network of experts on the forefront of industry initiatives\nAccess to wide ranging learning and development opportunities\nBe a part of supporting our diverse company culture through open engagement with our Young Employees Forum, Diversity and Inclusion Forum, Buro Happold Women's Network, and\/or our Black at Buro Happold Employee Resource Groups\nLearn more about our office locations\n\nReady for something a little less ordinary? \nApply now to start your career journey with us. ",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:31.429376",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Staff Engineer - New Grad",
    "company":"Bohler Engineering",
    "location":"Philadelphia, PA, USA\nBethlehem, PA, USA\nAtlanta, GA, USA\nRaleigh, NC, USA\nBoca Raton, FL, USA\nPittsburgh, PA, USA\nTampa, FL, USA\nWilmington, DE, USA\nHerndon, VA, USA\nBedford, NH, USA\nFairfield, CT, USA\nOrlando, FL, USA\nColumbus, OH, USA\nWestborough, MA, USA\nChalfont, PA, USA\nWarrenton, VA, USA\nBoston, MA, USA\nFrisco, TX, USA\nHarrisburg, PA, USA\nRichmond, VA, USA\nNashville, TN, USA\nRehoboth Beach, DE, USA",
    "deadline":"October 30, 2026",
    "compensation":"Not listed",
    "targeted_major":"College of Engineering\/Environmental Engineering\nCollege of Engineering\/Civil Engineering",
    "minimum_gpa":"Not listed",
    "description":"To be considered, please apply on our website!\nAt Bohler, we empower the ambitious to become the accomplished.  This greater purpose connects us with like-minded professionals, fosters meaningful relationships, and generates the alignment necessary to produce an unrivaled consulting and employment experience.\n  We are looking for Staff Engineers who embodies this purpose.\n  What You'll Do:\nAs a Staff Engineer at Bohler, you will:\nCollaborate with team members to work on challenging land development projects in a fun, fast-paced environment\nHone your technical site design knowledge and \"hands on\" plan preparation experience\nDesign site plans for some of the most recognizable brand name clients across a wide spectrum of industries\nPartner with your manager to tailor your career path towards YOUR vision\n  What We Offer:\nA supportive and flexible work environment that empowers employees to stay healthy, fulfill their passions, and balance work and life goals\nThe opportunity to take ownership of your career with an unsurpassed focus on career development and mentorship\nA Learning & Development department that facilitates ongoing soft and technical skills training, including individualized AutoCAD training\nComplete visibility and exposure to all aspects of a project\nThe opportunity to immerse yourself in the design process, while working hand-in-hand with team members\nOpen and transparent communication with senior leadership as well as local office management\nTeam building activities\/events and a collaborative work environment\n  What You'll Need:\nThe ability to learn quickly, strong communication skills, and a solid work ethic\nA passion for design and creative problem-solving\nA Bachelor's or Master's degree in Civil Engineering, or a related field\nAutoCAD Civil 3D experience is a plus; but if you don't have it, we'll help you get it!\n  Why Bohler \nBohler provides land development consulting and site design services to owners and developers across all commercial, institutional, and residential markets. Our team of experts works closely with top real estate professionals to identify opportunities and create successful land development projects that transform communities.\n  The Bohler Way\nWhen driven people come together, the results are inspiring. Our unique culture, The Bohler Way, defines our values and the actions we take when we're at our best. It positions us to deliver on our purpose and creates an environment where motivated people relentlessly pursue growth and accomplishment.\n  Bohler is an equal opportunity employer and affords equal opportunity to all applicants and employees for all positions without regard to race, color, religion, gender, national origin, age, disability, veteran status or any other status protected under local, state or federal laws.\nTo be considered, please apply on our website!",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:34.086013",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Landscape Designer",
    "company":"Bohler Engineering",
    "location":"Westborough, MA, USA\nBoston, MA, USA",
    "deadline":"December 31, 2025",
    "compensation":"Not listed",
    "targeted_major":"College of Arts, Media & Design\/Landscape Architecture",
    "minimum_gpa":"Not listed",
    "description":"To be considered, please apply on our website!\nAt Bohler, we empower the ambitious to become the accomplished.  This greater purpose connects us with like-minded professionals, fosters meaningful relationships, and generates the alignment necessary to produce an unrivaled consulting and employment experience.\n  Our Orlando office is looking for a Landscape Designer who embodies this purpose.\n  What You'll Do:\n  As a Landscape Designer at Bohler, you will:\nCollaborate with team members to work on challenging landscape design projects in a fun, fast-paced environment\nHone your technical design knowledge and \"hands on\" plan preparation experience (including hardscape, planting, and lighting)\nDesign landscape packages for some of the most recognizable brand name clients across a wide spectrum of industries\nPartner with your manager to tailor your career path towards YOUR vision\n  What We Offer:\n  A supportive and flexible work environment that empowers employees to stay healthy, fulfill their passions, and balance work and life goals\nThe opportunity to take ownership of your career with an unsurpassed focus on career development and mentorship\nA Learning & Development department that facilitates ongoing soft and technical skills training\nComplete visibility and exposure to all aspects of a project\nThe opportunity to immerse yourself in the design process, while working hand-in-hand with team members\nOpen and transparent communication with senior leadership as well as local office management\nTeam building activities\/events and a collaborative work environment\n  What You'll Need:\n  The ability to learn quickly, strong communication skills, and a solid work ethic\nA passion for design and creative knack for problem-solving\nExperience developing graphic exhibits and construction documents of landscape plans\nA Bachelor's or Master's degree in Landscape Architecture or Planning from an accredited program\nAutoCAD Civil 3D experience is a plus; along with Adobe Creative Suite and SketchUp\nWhy Bohler \nBohler provides land development consulting and site design services to owners and developers across all commercial, institutional, and residential markets. Our team of experts works closely with top real estate professionals to identify opportunities and create successful land development projects that transform communities.\n  The Bohler Way\nWhen driven people come together, the results are inspiring. Our unique culture, The Bohler Way, defines our values and the actions we take when we're at our best. It positions us to deliver on our purpose and creates an environment where motivated people relentlessly pursue growth and accomplishment.\n  Bohler is an equal opportunity employer and affords equal opportunity to all applicants and employees for all positions without regard to race, color, religion, gender, national origin, age, disability, veteran status or any other status protected under local, state or federal laws. \nTo be considered, please apply on our website!",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:36.773037",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Assistant Director of College Students Support Services",
    "company":"RCA Interactive Software Systems and Academic Services Co",
    "location":"Boston, MA, USA",
    "deadline":"January 30, 2026",
    "compensation":"$60,000 - $70,000 per year",
    "targeted_major":"College of Professional Studies\nCollege of Professional Studies\/Project Management\nCollege of Professional Studies\/Nonprofit Management\nCollege of Professional Studies\/Organizational Leadership\nCollege of Professional Studies\/Information Technology\nCollege of Professional Studies\/Corporate & Org Communication\nCollege of Professional Studies\/Commerce and Economic Development\nCollege of Professional Studies\/Human Resources\nCollege of Social Sciences & Humanities\/Human Services\nCollege of Social Sciences & Humanities\/Economics\nD'Amore-McKim School of Business\/Social Innovation & Entrepreneurship",
    "minimum_gpa":"Not listed",
    "description":"     First the Assistant Director of College Students Support Services will meet and work closely with many Senior officials at junior and Senior colleges. These officials include Deans , department heads, and many student government associations presidents student clubs, and fraternities and sororities; just to name a few.   Second, you will conduct a very thorough needs analysis to help RCA-ACT SOFTWARE CORP determine some of the financial and material needs of many selected Student Support Services organizations. \n     Third, using a very large budget from RCA -ACT SOFTWARE CORP you will help RCA-ACT SOFTWARE CORP sponsor and financially contribute to the many financial and material needs of the target audience.\n     Finally, the Assistant Director of College Students Support Services will help RCA -ACT SOFTWARE CORP design and implement ways for our target audience to Give Back to the Community and Make a Difference in the community by using our products and services to help the community; while helping themselves.",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:39.448992",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  },
  {
    "title":"Assistant Director of Sports teams and Clubs Sponsorships",
    "company":"RCA Interactive Software Systems and Academic Services Co",
    "location":"Boston, MA, USA",
    "deadline":"January 6, 2026",
    "compensation":"$60,000 - $70,000 per year",
    "targeted_major":"College of Professional Studies\nCollege of Professional Studies\/Project Management\nCollege of Professional Studies\/Nonprofit Management\nCollege of Professional Studies\/Organizational Leadership\nCollege of Professional Studies\/Information Technology\nCollege of Professional Studies\/Corporate & Org Communication\nCollege of Professional Studies\/Commerce and Economic Development\nCollege of Social Sciences & Humanities\nCollege of Social Sciences & Humanities\/Economics\nD'Amore-McKim School of Business\nD'Amore-McKim School of Business\/Management",
    "minimum_gpa":"Not listed",
    "description":"The assistant director of sports teams and clubs Sponsorships will meet with many Senior Officials such as coaches, trainers and players\/students from high schools, collegiate and non collegiate sports teams and the local community. Second, you will conduct a very thorough needs analysis to determine some of the financial and material needs of the players and each team as a whole. Third, using a very large budget from RCA -ACT SOFTWARE CORP you will help select and local sports teams events, games and material items. Fourth, you will attend some of the local sports games and events being sponsored by RCA -ACT SOFTWARE CORP OF Massachusetts. Finally, you will design ways for the Sponsored players and teams to Give Back to the Community and MAKE a Difference in the community using the products and services of RCA -ACT SOFTWARE CORP OF MASSACHUSETTS.",
    "status":"NEW",
    "scraped_at":"2025-12-15T14:27:42.145315",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  }
]