[
  {
    "title":"Software Engineering Co-op",
    "company":"getIntro",
    "location":"Boston, MA, USA",
    "deadline":"December 31, 2025",
    "compensation":"$2,000 - $3,000 per month",
    "targeted major":"College of Engineering\nCollege of Engineering\/Information Systems\nCollege of Engineering\/Internet of Things",
    "minimum GPA":"3.0",
    "description":"Company name: getIntro\nJob title: Software Engineering Co-op\nPhysical company location: 55 Court St, 2nd Floor, Boston, MA 02203\nTerm length: Spring 2026 with option to continue through Summer 2026\nStart date: 12\/15\/2025\nEnd date: 8\/31\/2026\nRole type: Hybrid (~50% in person)\nPay rate: $2,000 - $3,000 per month\nAbout getIntro\nAt getIntro, we’re reimagining how enterprise healthcare sales work—from the ground up. Our AI agents don’t just automate tasks; they help sales teams think and act strategically, focusing only on what truly matters: building real human relationships with the right decision-makers. The result? less noise, faster sales cycles, and revenue that lands sooner.\nWe’re a small team of experienced founders who’ve built and exited successful healthtech and AI companies. We’re tackling one of the hardest problems in B2B sales: turning unstructured signals and relationship data into intelligent guidance that actually drives action.\nIf you love moving fast and solving complex technical challenges that have real-world business impact—and want to build alongside people who’ve done it before—this is your chance to get in early and help shape something foundational.\nAbout You\nYou are energized by early-stage startups\nYou are impatient and blazingly fast\nYou love solving hard problems and love to experiment\nYou have interest in agentic AI\nYou think creatively to find simple solutions to hard problems\nYou take ownership and get things done without much handholding\nYou are fearless and jump in to help wherever needed\nAbout the Role\nAble to work a minimum of 20 hours per week\nWorking across the technology stack\nBuilding high-quality semantic search\nBuilding with agentic frameworks\nManaging large data sets and graph data\nDelivering commercial\/production quality code",
    "status":"NEW",
    "scraped_at":"2025-12-04T13:50:58.648602",
    "search_keywords":"software engineering",
    "search_location":"Boston, MA, USA"
  }
]